---
kind: other
id: Methods.T:Autodesk.Revit.DB.ElementBinding
source: html/3789120a-a7e6-04e6-25b8-6e89b2796175.htm
---
# ElementBinding Methods

Causes the object to release immediately any resources it may be utilizing.